Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DigitalCompassDisplay/source/MKL25Z4_Project_SparkfunTFTHyperDisplayConfigure.c
///*
// * KL25Z_TFT_DisplayTest.c
// *
// * FRDM-KL25Z port of SparkFun HyperDisplay Example1_DisplayTest
// * for the SparkFun 1.8in 128x160 KWH018ST01 / ILI9163C TFT.
// *
// * Fixed TFT wiring used by this project:
// *
// *   FRDM-KL25Z             SparkFun TFT
// *   --------------------------------------
// *   PTD1  SPI0_SCK   ----> SCLK
// *   PTD2  SPI0_SOUT  ----> MOSI
// *   PTA17 GPIO       ----> LCDCS
// *   PTA16 GPIO       ----> D/C
// *   3.3 V            ----> 3V3-5V5
// *   GND              ----> GND
// *
// * MISO is not required for the TFT-only write path.
// * PWM/backlight control is intentionally omitted from the first bring-up.
// */
//
//#include <stdint.h>
//#include <stdbool.h>
//
//#include "board.h"
//#include "pin_mux.h"
//#include "clock_config.h"
//
//#include "fsl_clock.h"
//#include "fsl_common.h"
//#include "fsl_debug_console.h"
//#include "fsl_gpio.h"
//#include "fsl_port.h"
//#include "fsl_spi.h"
//
//#include "HyperDisplay_KWH018ST01_4WSPI.h"
//#include "fast_hsv2rgb.h"
//
///* -------------------------------------------------------------------------- */
///* TFT hardware                                                               */
///* -------------------------------------------------------------------------- */
//
//#define TFT_SPI_BASE              SPI0
//
//#define TFT_SCK_PORT              PORTD
//#define TFT_SCK_PIN               1U
//
//#define TFT_MOSI_PORT             PORTD
//#define TFT_MOSI_PIN              2U
//
//#define TFT_DC_PORT               PORTA
//#define TFT_DC_GPIO               GPIOA
//#define TFT_DC_PIN                16U
//
//#define TFT_CS_PORT               PORTA
//#define TFT_CS_GPIO               GPIOA
//#define TFT_CS_PIN                17U
//
//#define TFT_SPI_BAUDRATE_HZ       1000000U
//
///* -------------------------------------------------------------------------- */
///* Globals                                                                    */
///* -------------------------------------------------------------------------- */
//
//static KWH018ST01_4WSPI_t g_tft;
//static ILI9163C_color_18_t g_defaultColor;
//
///* -------------------------------------------------------------------------- */
///* Local prototypes                                                           */
///* -------------------------------------------------------------------------- */
//
//static void TFT_InitPins(void);
//static void TFT_InitSPI(void);
//static void TFT_DelayMs(uint32_t milliseconds);
//static hyperdisplay_t *TFT_GetHyperDisplay(void);
//static void TFT_PrintString(hyperdisplay_t *hd, const char *text);
//
//static void TextTest(void);
//static void LineTest(void);
//static void RectangleTest(void);
//static void CircleTest(void);
//
///* -------------------------------------------------------------------------- */
///* KL25Z hardware initialization                                              */
///* -------------------------------------------------------------------------- */
//
//static void TFT_InitPins(void)
//{
//    CLOCK_EnableClock(kCLOCK_PortD);
//    CLOCK_EnableClock(kCLOCK_PortA);
//
//    /* PTD1 = SPI0_SCK, PTD2 = SPI0_SOUT/MOSI. */
//    PORT_SetPinMux(TFT_SCK_PORT, TFT_SCK_PIN, kPORT_MuxAlt2);
//    PORT_SetPinMux(TFT_MOSI_PORT, TFT_MOSI_PIN, kPORT_MuxAlt2);
//
//    /* LCDCS and D/C are GPIO outputs. */
//    PORT_SetPinMux(TFT_CS_PORT, TFT_CS_PIN, kPORT_MuxAsGpio);
//    PORT_SetPinMux(TFT_DC_PORT, TFT_DC_PIN, kPORT_MuxAsGpio);
//}
//
//static void TFT_InitSPI(void)
//{
//    spi_master_config_t masterConfig;
//    uint32_t sourceClockHz;
//
//    CLOCK_EnableClock(kCLOCK_Spi0);
//
//    SPI_MasterGetDefaultConfig(&masterConfig);
//
//    masterConfig.baudRate_Bps = TFT_SPI_BAUDRATE_HZ;
//
//    /* SPI Mode 0. */
//    masterConfig.polarity = kSPI_ClockPolarityActiveHigh;
//    masterConfig.phase = kSPI_ClockPhaseFirstEdge;
//
//    /* MSB first. */
//    masterConfig.direction = kSPI_MsbFirst;
//
//    /* CS is controlled manually using PTA17. */
//    masterConfig.outputMode = kSPI_SlaveSelectAsGpio;
//    masterConfig.pinMode = kSPI_PinModeNormal;
//
//    sourceClockHz = CLOCK_GetFreq(kCLOCK_BusClk);
//
//    SPI_MasterInit(
//        TFT_SPI_BASE,
//        &masterConfig,
//        sourceClockHz);
//}
//
////static void TFT_DelayMs(uint32_t milliseconds)
////{
////    if (milliseconds == 0U)
////    {
////        return;
////    }
////
////    SDK_DelayAtLeastUs(
////        milliseconds * 1000U,
////        SystemCoreClock);
////}
//
//
//static void TFT_DelayMs(uint32_t milliseconds)
//{
//    uint32_t reload;
//
//    if (milliseconds == 0U)
//    {
//        return;
//    }
//
//    reload = (SystemCoreClock / 1000U) - 1U;
//
//    SysTick->LOAD = reload;
//    SysTick->VAL  = 0U;
//
//    SysTick->CTRL =
//        SysTick_CTRL_CLKSOURCE_Msk |
//        SysTick_CTRL_ENABLE_Msk;
//
//    while (milliseconds > 0U)
//    {
//        while ((SysTick->CTRL &
//                SysTick_CTRL_COUNTFLAG_Msk) == 0U)
//        {
//        }
//
//        milliseconds--;
//    }
//
//    SysTick->CTRL = 0U;
//}
//
//
//static hyperdisplay_t *TFT_GetHyperDisplay(void)
//{
//    return &g_tft.ili9163c4wspi.ili9163c.hyperdisplay;
//}
//
///* -------------------------------------------------------------------------- */
///* Text helper                                                                */
///* -------------------------------------------------------------------------- */
//
//static void TFT_PrintString(
//    hyperdisplay_t *hd,
//    const char *text)
//{
//    if ((hd == NULL) || (text == NULL))
//    {
//        return;
//    }
//
//    while (*text != '\0')
//    {
//        (void)hyperdisplay_write(
//            hd,
//            (uint8_t)*text);
//
//        text++;
//    }
//}
//
///* -------------------------------------------------------------------------- */
///* Text test                                                                  */
///* -------------------------------------------------------------------------- */
//
//static void TextTest(void)
//{
//    hyperdisplay_t *hd = TFT_GetHyperDisplay();
//    uint16_t hue;
//
//    KWH018ST01_4WSPI_clearDisplay(&g_tft);
//
//    hyperdisplay_setCurrentWindowColorSequence(
//        hd,
//        (color_t)&g_defaultColor,
//        1U,
//        0U);
//
//    for (hue = HSV_HUE_MIN;
//         hue <= HSV_HUE_MAX;
//         hue = (uint16_t)(hue + 30U))
//    {
//        hyperdisplay_setTextCursor(
//            hd,
//            0,
//            0,
//            NULL);
//
//        g_defaultColor =
//            ILI9163C_hsvTo18b(
//                hue,
//                255U,
//                255U);
//
//        TFT_PrintString(
//            hd,
//            "Hello world!");
//
//        if ((uint16_t)(HSV_HUE_MAX - hue) < 30U)
//        {
//            break;
//        }
//    }
//}
//
///* -------------------------------------------------------------------------- */
///* Line test                                                                  */
///* -------------------------------------------------------------------------- */
//
//static void LineTest(void)
//{
//    hyperdisplay_t *hd = TFT_GetHyperDisplay();
//    ILI9163C_color_18_t color;
//    hd_hw_extent_t i;
//
//    KWH018ST01_4WSPI_clearDisplay(&g_tft);
//
//    /* White lines from top-left. */
//    color = ILI9163C_rgbTo18b(
//        255U,
//        255U,
//        255U);
//
//    for (i = 0U; i < hd->xExt; i++)
//    {
//        (void)hyperdisplay_line(
//            hd,
//            0.0,
//            0.0,
//            (hd_extent_t)i,
//            (hd_extent_t)(hd->yExt - 1U),
//            1U,
//            (color_t)&color,
//            1U,
//            0U,
//            false);
//    }
//
//    /* Red lines from bottom-left. */
//    color = ILI9163C_rgbTo18b(
//        255U,
//        0U,
//        0U);
//
//    for (i = 0U; i < hd->yExt; i++)
//    {
//        (void)hyperdisplay_line(
//            hd,
//            0.0,
//            (hd_extent_t)(hd->yExt - 1U),
//            (hd_extent_t)(hd->xExt - 1U),
//            (hd_extent_t)(hd->yExt - i - 1U),
//            1U,
//            (color_t)&color,
//            1U,
//            0U,
//            false);
//    }
//
//    /* Green lines from bottom-right. */
//    color = ILI9163C_rgbTo18b(
//        0U,
//        255U,
//        0U);
//
//    for (i = 0U; i < hd->xExt; i++)
//    {
//        (void)hyperdisplay_line(
//            hd,
//            (hd_extent_t)(hd->xExt - 1U),
//            (hd_extent_t)(hd->yExt - 1U),
//            (hd_extent_t)(hd->xExt - i - 1U),
//            0.0,
//            1U,
//            (color_t)&color,
//            1U,
//            0U,
//            false);
//    }
//
//    /* Blue lines from top-right. */
//    color = ILI9163C_rgbTo18b(
//        0U,
//        0U,
//        255U);
//
//    for (i = 0U; i < hd->yExt; i++)
//    {
//        (void)hyperdisplay_line(
//            hd,
//            (hd_extent_t)(hd->xExt - 1U),
//            0.0,
//            0.0,
//            (hd_extent_t)i,
//            1U,
//            (color_t)&color,
//            1U,
//            0U,
//            false);
//    }
//}
//
///* -------------------------------------------------------------------------- */
///* Rectangle test                                                             */
///* -------------------------------------------------------------------------- */
//
//static void RectangleTest(void)
//{
//    hyperdisplay_t *hd = TFT_GetHyperDisplay();
//
//    ILI9163C_color_18_t color;
//
//    hd_hw_extent_t i;
//    hd_hw_extent_t halfX;
//    hd_hw_extent_t halfY;
//
//    KWH018ST01_4WSPI_clearDisplay(&g_tft);
//
//    halfX = (hd_hw_extent_t)(hd->xExt / 2U);
//    halfY = (hd_hw_extent_t)(hd->yExt / 2U);
//
//    color = ILI9163C_rgbTo18b(
//        255U,
//        255U,
//        255U);
//
//    for (i = 0U; i < halfX; i++)
//    {
//        hyperdisplay_rectangle(
//            hd,
//            (hd_extent_t)(halfX - 1U - i),
//            (hd_extent_t)(halfY - 1U - i),
//            (hd_extent_t)(halfX + 1U + i),
//            (hd_extent_t)(halfY + 1U + i),
//            false,
//            (color_t)&color,
//            1U,
//            0U,
//            false,
//            false);
//
//        TFT_DelayMs(50U);
//    }
//
//    /* Fill entire display blue. */
//    color = ILI9163C_rgbTo18b(
//        0U,
//        0U,
//        255U);
//
//    hyperdisplay_rectangle(
//        hd,
//        0.0,
//        0.0,
//        (hd_extent_t)(hd->xExt - 1U),
//        (hd_extent_t)(hd->yExt - 1U),
//        true,
//        (color_t)&color,
//        1U,
//        0U,
//        false,
//        false);
//
//    /* Black rectangles. */
//    color = ILI9163C_rgbTo18b(
//        0U,
//        0U,
//        0U);
//
//    for (i = 0U; i < halfX; i++)
//    {
//        hyperdisplay_rectangle(
//            hd,
//            (hd_extent_t)(halfX - 1U - i),
//            (hd_extent_t)(halfY - 1U - i),
//            (hd_extent_t)(halfX + 1U + i),
//            (hd_extent_t)(halfY + 1U + i),
//            false,
//            (color_t)&color,
//            1U,
//            0U,
//            false,
//            false);
//
//        TFT_DelayMs(50U);
//    }
//}
//
///* -------------------------------------------------------------------------- */
///* Circle test                                                                */
///* -------------------------------------------------------------------------- */
//
//static void CircleTest(void)
//{
//    hyperdisplay_t *hd = TFT_GetHyperDisplay();
//
//    ILI9163C_color_18_t color;
//
//    hd_hw_extent_t i;
//    hd_hw_extent_t halfX;
//    hd_hw_extent_t halfY;
//    hd_hw_extent_t maxRadius;
//
//    halfX = (hd_hw_extent_t)(hd->xExt / 2U);
//    halfY = (hd_hw_extent_t)(hd->yExt / 2U);
//
//    maxRadius =
//        (hd_hw_extent_t)(halfX - 1U);
//
//    KWH018ST01_4WSPI_clearDisplay(&g_tft);
//
//    for (i = 0U; i < maxRadius; i++)
//    {
//        uint16_t hue;
//
//        hue =
//            (uint16_t)(
//                ((uint32_t)HSV_HUE_MAX *
//                 (uint32_t)i) /
//                (uint32_t)maxRadius);
//
//        color =
//            ILI9163C_hsvTo18b(
//                hue,
//                255U,
//                255U);
//
//        hyperdisplay_circle(
//            hd,
//            (hd_extent_t)(halfX - 1U),
//            (hd_extent_t)(halfY - 1U),
//            (hd_extent_t)(maxRadius - i),
//            true,
//            (color_t)&color,
//            1U,
//            0U,
//            false);
//
//        TFT_DelayMs(100U);
//    }
//}
//
///* -------------------------------------------------------------------------- */
///* main                                                                       */
///* -------------------------------------------------------------------------- */
//
//int main(void)
//{
//    ILI9163C_STAT_t status;
//
//    BOARD_InitBootPins();
//    BOARD_InitBootClocks();
//    BOARD_InitDebugConsole();
//
//    PRINTF(
//        "\r\nKL25Z + SparkFun 1.8in TFT Display Test\r\n");
//
//    TFT_InitPins();
//    TFT_InitSPI();
//
//    KWH018ST01_4WSPI_init(&g_tft);
//
//    status =
//        KWH018ST01_4WSPI_begin(
//            &g_tft,
//
//            TFT_SPI_BASE,
//
//            TFT_DC_GPIO,
//            TFT_DC_PIN,
//
//            TFT_CS_GPIO,
//            TFT_CS_PIN,
//
//            NULL,
//            NULL,
//
//            TFT_SPI_BAUDRATE_HZ);
//
//    if (status != ILI9163C_STAT_Nominal)
//    {
//        PRINTF(
//            "TFT initialization FAILED.\r\n");
//
//        while (1)
//        {
//        }
//    }
//
//    PRINTF(
//        "TFT initialization successful.\r\n");
//
//    TextTest();
//
//    TFT_DelayMs(1000U);
//
//    while (1)
//    {
//        PRINTF("Line test\r\n");
//
//        LineTest();
//
//        TFT_DelayMs(500U);
//
//        PRINTF("Rectangle test\r\n");
//
//        RectangleTest();
//
//        TFT_DelayMs(500U);
//
//        PRINTF("Circle test\r\n");
//
//        CircleTest();
//
//        TFT_DelayMs(500U);
//
//        PRINTF("Text test\r\n");
//
//        TextTest();
//
//        TFT_DelayMs(1000U);
//    }
//}

















