Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DigitalCompassDisplay/source/MKL25Z4_Project_SparkfunTFTHyperDisplayConfigure.c
/*
 * FRDM-KL25Z + SparkFun 1.8" 128x160 TFT
 * Static Compass Display Demo
 *
 * TFT wiring:
 *
 *   FRDM-KL25Z             SparkFun TFT
 *   --------------------------------------
 *   PTD1  SPI0_SCK   ----> SCLK
 *   PTD2  SPI0_SOUT  ----> MOSI
 *   PTA17 GPIO       ----> LCDCS
 *   PTA16 GPIO       ----> D/C
 *   3.3V             ----> 3V3-5V5
 *   GND              ----> GND
 */
//
//#include <stdint.h>
//#include <stdbool.h>
//
//#include "board.h"
//#include "pin_mux.h"
//#include "clock_config.h"
//
//#include "fsl_clock.h"
//#include "fsl_common.h"
//#include "fsl_debug_console.h"
//#include "fsl_gpio.h"
//#include "fsl_port.h"
//#include "fsl_spi.h"
//
//#include "HyperDisplay_KWH018ST01_4WSPI.h"
//
///* -------------------------------------------------------------------------- */
///* TFT hardware                                                               */
///* -------------------------------------------------------------------------- */
//
//#define TFT_SPI_BASE              SPI0
//
//#define TFT_SCK_PORT              PORTD
//#define TFT_SCK_PIN               1U
//
//#define TFT_MOSI_PORT             PORTD
//#define TFT_MOSI_PIN              2U
//
//#define TFT_DC_PORT               PORTA
//#define TFT_DC_GPIO               GPIOA
//#define TFT_DC_PIN                16U
//
//#define TFT_CS_PORT               PORTA
//#define TFT_CS_GPIO               GPIOA
//#define TFT_CS_PIN                17U
//
///* Keep the known-good bring-up speed for now. */
//#define TFT_SPI_BAUDRATE_HZ       1000000U
//
///* -------------------------------------------------------------------------- */
///* Compass geometry                                                           */
///* -------------------------------------------------------------------------- */
//
//#define COMPASS_CENTER_X          64
//#define COMPASS_CENTER_Y          58
//#define COMPASS_RADIUS            48
//
//typedef struct
//{
//    int16_t x1;
//    int16_t y1;
//    int16_t x2;
//    int16_t y2;
//} compass_tick_t;
//
///*
// * Pre-calculated tick locations every 15 degrees.
// *
// * This avoids needing sin() and cos() for the static compass face.
// */
//static const compass_tick_t g_compassTicks[] =
//{
//    {64, 19, 64, 10},     /*   0 */
//    {75, 16, 76, 12},     /*  15 */
//    {86, 21, 88, 16},     /*  30 */
//    {94, 28, 98, 24},     /*  45 */
//    {101,36,106,34},      /*  60 */
//    {106,47,110,46},      /*  75 */
//
//    {103,58,112,58},      /*  90 */
//    {106,69,110,70},      /* 105 */
//    {101,79,106,82},      /* 120 */
//    {94, 88, 98, 92},     /* 135 */
//    {86, 95, 88,100},     /* 150 */
//    {75,100, 76,104},     /* 165 */
//
//    {64, 97, 64,106},     /* 180 */
//    {53,100, 52,104},     /* 195 */
//    {42, 95, 40,100},     /* 210 */
//    {34, 88, 30, 92},     /* 225 */
//    {27, 80, 22, 82},     /* 240 */
//    {22, 69, 18, 70},     /* 255 */
//
//    {25, 58, 16, 58},     /* 270 */
//    {22, 47, 18, 46},     /* 285 */
//    {27, 36, 22, 34},     /* 300 */
//    {34, 28, 30, 24},     /* 315 */
//    {42, 21, 40, 16},     /* 330 */
//    {53, 16, 52, 12}      /* 345 */
//};
//
//#define COMPASS_NUM_TICKS \
//    (sizeof(g_compassTicks) / sizeof(g_compassTicks[0]))
//
///* -------------------------------------------------------------------------- */
///* Globals                                                                    */
///* -------------------------------------------------------------------------- */
//
//static KWH018ST01_4WSPI_t g_tft;
//
///* -------------------------------------------------------------------------- */
///* Function prototypes                                                        */
///* -------------------------------------------------------------------------- */
//
//static void TFT_InitPins(void);
//static void TFT_InitSPI(void);
//
//static hyperdisplay_t *TFT_GetHyperDisplay(void);
//
//static void TFT_PrintString(
//    hyperdisplay_t *hd,
//    int32_t x,
//    int32_t y,
//    const char *text);
//
//static void Compass_DrawFace(void);
//static void Compass_DrawNeedle143(void);
//static void Compass_DrawHeading(void);
//static void Compass_DrawDemo(void);
//
///* -------------------------------------------------------------------------- */
///* TFT pin initialization                                                     */
///* -------------------------------------------------------------------------- */
//
//static void TFT_InitPins(void)
//{
//    CLOCK_EnableClock(kCLOCK_PortD);
//    CLOCK_EnableClock(kCLOCK_PortA);
//
//    /*
//     * SPI0:
//     *
//     * PTD1 = SPI0_SCK
//     * PTD2 = SPI0_SOUT / MOSI
//     */
//    PORT_SetPinMux(
//        TFT_SCK_PORT,
//        TFT_SCK_PIN,
//        kPORT_MuxAlt2);
//
//    PORT_SetPinMux(
//        TFT_MOSI_PORT,
//        TFT_MOSI_PIN,
//        kPORT_MuxAlt2);
//
//    /*
//     * GPIO:
//     *
//     * PTA17 = TFT CS
//     * PTA16 = TFT D/C
//     */
//    PORT_SetPinMux(
//        TFT_CS_PORT,
//        TFT_CS_PIN,
//        kPORT_MuxAsGpio);
//
//    PORT_SetPinMux(
//        TFT_DC_PORT,
//        TFT_DC_PIN,
//        kPORT_MuxAsGpio);
//}
//
///* -------------------------------------------------------------------------- */
///* SPI initialization                                                         */
///* -------------------------------------------------------------------------- */
//
//static void TFT_InitSPI(void)
//{
//    spi_master_config_t masterConfig;
//    uint32_t sourceClockHz;
//
//    CLOCK_EnableClock(kCLOCK_Spi0);
//
//    SPI_MasterGetDefaultConfig(&masterConfig);
//
//    masterConfig.baudRate_Bps =
//        TFT_SPI_BAUDRATE_HZ;
//
//    /*
//     * ILI9163C:
//     *
//     * SPI Mode 0
//     * Clock idle LOW
//     * Data captured on first edge
//     */
//    masterConfig.polarity =
//        kSPI_ClockPolarityActiveHigh;
//
//    masterConfig.phase =
//        kSPI_ClockPhaseFirstEdge;
//
//    masterConfig.direction =
//        kSPI_MsbFirst;
//
//    /*
//     * We manually control TFT chip select
//     * using PTA17.
//     */
//    masterConfig.outputMode =
//        kSPI_SlaveSelectAsGpio;
//
//    masterConfig.pinMode =
//        kSPI_PinModeNormal;
//
//    sourceClockHz =
//        CLOCK_GetFreq(kCLOCK_BusClk);
//
//    SPI_MasterInit(
//        TFT_SPI_BASE,
//        &masterConfig,
//        sourceClockHz);
//}
//
///* -------------------------------------------------------------------------- */
///* HyperDisplay access                                                        */
///* -------------------------------------------------------------------------- */
//
//static hyperdisplay_t *TFT_GetHyperDisplay(void)
//{
//    return
//        &g_tft
//            .ili9163c4wspi
//            .ili9163c
//            .hyperdisplay;
//}
//
///* -------------------------------------------------------------------------- */
///* 5x7 text helper                                                            */
///* -------------------------------------------------------------------------- */
//
//static void TFT_PrintString(
//    hyperdisplay_t *hd,
//    int32_t x,
//    int32_t y,
//    const char *text)
//{
//    if ((hd == NULL) || (text == NULL))
//    {
//        return;
//    }
//
//    hyperdisplay_setTextCursor(
//        hd,
//        x,
//        y,
//        NULL);
//
//    while (*text != '\0')
//    {
//        (void)hyperdisplay_write(
//            hd,
//            (uint8_t)*text);
//
//        text++;
//    }
//}
//
///* -------------------------------------------------------------------------- */
///* Draw compass face                                                          */
///* -------------------------------------------------------------------------- */
//
//static void Compass_DrawFace(void)
//{
//    hyperdisplay_t *hd;
//
//    ILI9163C_color_18_t green;
//    uint32_t i;
//
//    hd = TFT_GetHyperDisplay();
//
//    /*
//     * Bright green similar to the design
//     * we selected.
//     */
//    green =
//        ILI9163C_rgbTo18b(
//            80U,
//            255U,
//            40U);
//
//    /*
//     * Tell HyperDisplay that our text color
//     * is green.
//     */
//    hyperdisplay_setCurrentWindowColorSequence(
//        hd,
//        (color_t)&green,
//        1U,
//        0U);
//
//    /* ------------------------------------------------------ */
//    /* Outer compass circle                                   */
//    /* ------------------------------------------------------ */
//
//    hyperdisplay_circle(
//        hd,
//
//        COMPASS_CENTER_X,
//        COMPASS_CENTER_Y,
//
//        COMPASS_RADIUS,
//
//        false,
//
//        (color_t)&green,
//        1U,
//        0U,
//
//        false);
//
//    /* ------------------------------------------------------ */
//    /* Compass tick marks                                     */
//    /* ------------------------------------------------------ */
//
//    for (i = 0U;
//         i < COMPASS_NUM_TICKS;
//         i++)
//    {
//        (void)hyperdisplay_line(
//            hd,
//
//            g_compassTicks[i].x1,
//            g_compassTicks[i].y1,
//
//            g_compassTicks[i].x2,
//            g_compassTicks[i].y2,
//
//            1U,
//
//            (color_t)&green,
//            1U,
//            0U,
//
//            false);
//    }
//
//    /* ------------------------------------------------------ */
//    /* Cardinal direction labels                              */
//    /* ------------------------------------------------------ */
//
//    /*
//     * Coordinates are deliberately placed
//     * inside the circle because we only have
//     * the 5x7 font right now.
//     */
//
//    TFT_PrintString(
//        hd,
//        61,
//        22,
//        "N");
//
//    TFT_PrintString(
//        hd,
//        98,
//        55,
//        "E");
//
//    TFT_PrintString(
//        hd,
//        61,
//        87,
//        "S");
//
//    TFT_PrintString(
//        hd,
//        25,
//        55,
//        "W");
//}
//
///* -------------------------------------------------------------------------- */
///* Draw example 143 degree needle                                             */
///* -------------------------------------------------------------------------- */
//
//static void Compass_DrawNeedle143(void)
//{
//    hyperdisplay_t *hd;
//
//    ILI9163C_color_18_t red;
//    ILI9163C_color_18_t white;
//    ILI9163C_color_18_t black;
//
//    hd = TFT_GetHyperDisplay();
//
//    red =
//        ILI9163C_rgbTo18b(
//            255U,
//            30U,
//            20U);
//
//    white =
//        ILI9163C_rgbTo18b(
//            255U,
//            255U,
//            255U);
//
//    black =
//        ILI9163C_rgbTo18b(
//            0U,
//            0U,
//            0U);
//
//    /*
//     * Heading = 143 degrees.
//     *
//     * For our screen coordinate system:
//     *
//     * center = (64,58)
//     *
//     * 143 degree endpoint ≈ (84,85)
//     *
//     * opposite endpoint ≈ (44,31)
//     */
//
//    /* ------------------------------------------------------ */
//    /* White rear half of needle                              */
//    /* ------------------------------------------------------ */
//
//    (void)hyperdisplay_line(
//        hd,
//
//        COMPASS_CENTER_X,
//        COMPASS_CENTER_Y,
//
//        44,
//        31,
//
//        3U,
//
//        (color_t)&white,
//        1U,
//        0U,
//
//        false);
//
//    /* ------------------------------------------------------ */
//    /* Red heading half                                      */
//    /* ------------------------------------------------------ */
//
//    (void)hyperdisplay_line(
//        hd,
//
//        COMPASS_CENTER_X,
//        COMPASS_CENTER_Y,
//
//        84,
//        85,
//
//        3U,
//
//        (color_t)&red,
//        1U,
//        0U,
//
//        false);
//
//    /* ------------------------------------------------------ */
//    /* Center hub                                            */
//    /* ------------------------------------------------------ */
//
//    hyperdisplay_circle(
//        hd,
//
//        COMPASS_CENTER_X,
//        COMPASS_CENTER_Y,
//
//        4,
//
//        true,
//
//        (color_t)&white,
//        1U,
//        0U,
//
//        false);
//
//    /*
//     * Small black dot inside the white hub.
//     */
//    hyperdisplay_circle(
//        hd,
//
//        COMPASS_CENTER_X,
//        COMPASS_CENTER_Y,
//
//        2,
//
//        true,
//
//        (color_t)&black,
//        1U,
//        0U,
//
//        false);
//}
//
///* -------------------------------------------------------------------------- */
///* Draw heading information                                                   */
///* -------------------------------------------------------------------------- */
//
//static void Compass_DrawHeading(void)
//{
//    hyperdisplay_t *hd;
//
//    ILI9163C_color_18_t green;
//
//    hd = TFT_GetHyperDisplay();
//
//    green =
//        ILI9163C_rgbTo18b(
//            80U,
//            255U,
//            40U);
//
//    hyperdisplay_setCurrentWindowColorSequence(
//        hd,
//        (color_t)&green,
//        1U,
//        0U);
//
//    /*
//     * Existing 5x7 font.
//     *
//     * "143" is approximately 18 pixels wide,
//     * so starting near x=54 centers it.
//     */
//
//    TFT_PrintString(
//        hd,
//        54,
//        119,
//        "143");
//
//    /*
//     * Draw the degree symbol ourselves since
//     * we do not need another font yet.
//     */
//    hyperdisplay_circle(
//        hd,
//
//        75,
//        120,
//
//        2,
//
//        false,
//
//        (color_t)&green,
//        1U,
//        0U,
//
//        false);
//
//    /*
//     * Direction text.
//     */
//    TFT_PrintString(
//        hd,
//        58,
//        132,
//        "SE");
//}
//
///* -------------------------------------------------------------------------- */
///* Complete compass screen                                                    */
///* -------------------------------------------------------------------------- */
//
//static void Compass_DrawDemo(void)
//{
//    /*
//     * clearDisplay() gives us the black
//     * background.
//     */
//    KWH018ST01_4WSPI_clearDisplay(
//        &g_tft);
//
//    Compass_DrawFace();
//
//    Compass_DrawNeedle143();
//
//    Compass_DrawHeading();
//}
//
///* -------------------------------------------------------------------------- */
///* main                                                                       */
///* -------------------------------------------------------------------------- */
//
//int main(void)
//{
//    ILI9163C_STAT_t status;
//
//    BOARD_InitBootPins();
//    BOARD_InitBootClocks();
//    BOARD_InitDebugConsole();
//
//    PRINTF(
//        "\r\n"
//        "KL25Z TFT Compass Display\r\n");
//
//    /* ------------------------------------------------------ */
//    /* Initialize TFT hardware                                */
//    /* ------------------------------------------------------ */
//
//    TFT_InitPins();
//
//    TFT_InitSPI();
//
//    KWH018ST01_4WSPI_init(
//        &g_tft);
//
//    status =
//        KWH018ST01_4WSPI_begin(
//            &g_tft,
//
//            TFT_SPI_BASE,
//
//            TFT_DC_GPIO,
//            TFT_DC_PIN,
//
//            TFT_CS_GPIO,
//            TFT_CS_PIN,
//
//            NULL,
//            NULL,
//
//            TFT_SPI_BAUDRATE_HZ);
//
//    if (status != ILI9163C_STAT_Nominal)
//    {
//        PRINTF(
//            "TFT initialization FAILED.\r\n");
//
//        while (1)
//        {
//        }
//    }
//
//    PRINTF(
//        "TFT initialization successful.\r\n");
//
//    /* ------------------------------------------------------ */
//    /* Draw compass                                           */
//    /* ------------------------------------------------------ */
//
//    Compass_DrawDemo();
//
//    PRINTF(
//        "Compass display drawn.\r\n");
//
//    /* ------------------------------------------------------ */
//    /* Nothing needs to move yet                              */
//    /* ------------------------------------------------------ */
//
//    while (1)
//    {
//        /*
//         * Static compass demo.
//         *
//         * Magnetometer updating will be
//         * added here later.
//         */
//    }
//}























