Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DigitalCompassDisplay/source/MKL25Z4_Project_SparkfunTFTHyperDisplayConfigure.c
/*
 * FRDM-KL25Z + MMC5983MA + SparkFun 1.8" TFT Compass
 *
 * Combined from:
 *   1) Known-good MMC5983MA four-point compass application
 *   2) Known-good SparkFun HyperDisplay TFT compass display
 *
 * TFT:
 *   PTD1  = SPI0_SCK  -> TFT SCLK
 *   PTD2  = SPI0_SOUT -> TFT MOSI
 *   PTA17 = GPIO      -> TFT LCDCS
 *   PTA16 = GPIO      -> TFT D/C
 *
 * MMC5983MA:
 *   PTC8  = I2C0_SCL
 *   PTC9  = I2C0_SDA
 *   Address = 0x30
 *
 * The low-level compass.c / compass.h driver is not modified.
 */

#include <stdbool.h>
#include <stdint.h>
#include <math.h>

#include "board.h"
#include "clock_config.h"
#include "pin_mux.h"

#include "fsl_clock.h"
#include "fsl_common.h"
#include "fsl_debug_console.h"
#include "fsl_gpio.h"
#include "fsl_i2c.h"
#include "fsl_port.h"
#include "fsl_spi.h"

#include "compass.h"
#include "HyperDisplay_KWH018ST01_4WSPI.h"

/* -------------------------------------------------------------------------- */
/* Compass I2C configuration                                                  */
/* -------------------------------------------------------------------------- */

#define COMPASS_I2C_BASE          I2C0
#define COMPASS_I2C_BAUDRATE      (100000U)

#define COMPASS_SCL_PORT          PORTC
#define COMPASS_SCL_PIN           8U

#define COMPASS_SDA_PORT          PORTC
#define COMPASS_SDA_PIN           9U

#define RAD_TO_DEG                (57.2957795f)

/* -------------------------------------------------------------------------- */
/* Four-point 2D environmental calibration constants                         */
/* -------------------------------------------------------------------------- */

#define COMPASS_X_BIAS_G          (-0.0255f)
#define COMPASS_Y_BIAS_G          ( 0.1375f)

#define COMPASS_X_RADIUS_G        ( 0.2365f)
#define COMPASS_Y_RADIUS_G        ( 0.2475f)

/* -------------------------------------------------------------------------- */
/* TFT hardware                                                               */
/* -------------------------------------------------------------------------- */

#define TFT_SPI_BASE              SPI0

#define TFT_SCK_PORT              PORTD
#define TFT_SCK_PIN               1U

#define TFT_MOSI_PORT             PORTD
#define TFT_MOSI_PIN              2U

#define TFT_DC_PORT               PORTA
#define TFT_DC_GPIO               GPIOA
#define TFT_DC_PIN                16U

#define TFT_CS_PORT               PORTA
#define TFT_CS_GPIO               GPIOA
#define TFT_CS_PIN                17U

/*
 * Keep the known-good conservative SPI speed.
 * Increase only after the integrated compass is stable.
 */
#define TFT_SPI_BAUDRATE_HZ       1000000U

/* -------------------------------------------------------------------------- */
/* Compass display geometry                                                   */
/* -------------------------------------------------------------------------- */

#define COMPASS_CENTER_X          64
#define COMPASS_CENTER_Y          58
#define COMPASS_RADIUS            48

/*
 * Keep the moving needle inside the green tick marks and cardinal letters.
 * This lets us erase only the old needle instead of redrawing the whole TFT.
 */
#define COMPASS_NEEDLE_FRONT      28
#define COMPASS_NEEDLE_REAR       21
#define COMPASS_NEEDLE_WIDTH      3U

typedef struct
{
    int16_t x1;
    int16_t y1;
    int16_t x2;
    int16_t y2;
} compass_tick_t;

/*
 * Tick marks every 15 degrees.
 */
static const compass_tick_t g_compassTicks[] =
{
    {64, 19, 64, 10},     /*   0 */
    {75, 16, 76, 12},     /*  15 */
    {86, 21, 88, 16},     /*  30 */
    {94, 28, 98, 24},     /*  45 */
    {101, 36, 106, 34},   /*  60 */
    {106, 47, 110, 46},   /*  75 */

    {103, 58, 112, 58},   /*  90 */
    {106, 69, 110, 70},   /* 105 */
    {101, 79, 106, 82},   /* 120 */
    {94, 88, 98, 92},     /* 135 */
    {86, 95, 88, 100},    /* 150 */
    {75, 100, 76, 104},   /* 165 */

    {64, 97, 64, 106},    /* 180 */
    {53, 100, 52, 104},   /* 195 */
    {42, 95, 40, 100},    /* 210 */
    {34, 88, 30, 92},     /* 225 */
    {27, 80, 22, 82},     /* 240 */
    {22, 69, 18, 70},     /* 255 */

    {25, 58, 16, 58},     /* 270 */
    {22, 47, 18, 46},     /* 285 */
    {27, 36, 22, 34},     /* 300 */
    {34, 28, 30, 24},     /* 315 */
    {42, 21, 40, 16},     /* 330 */
    {53, 16, 52, 12}      /* 345 */
};

#define COMPASS_NUM_TICKS \
    (sizeof(g_compassTicks) / sizeof(g_compassTicks[0]))

/* -------------------------------------------------------------------------- */
/* Globals                                                                    */
/* -------------------------------------------------------------------------- */

static KWH018ST01_4WSPI_t g_tft;

static ILI9163C_color_18_t g_colorGreen;
static ILI9163C_color_18_t g_colorRed;
static ILI9163C_color_18_t g_colorWhite;
static ILI9163C_color_18_t g_colorBlack;

static bool g_previousNeedleValid = false;
static int16_t g_previousNeedleDx = 0;
static int16_t g_previousNeedleDy = 0;

/* -------------------------------------------------------------------------- */
/* Local delay for older KL25Z SDK                                            */
/* -------------------------------------------------------------------------- */

static void APP_DelayUs(uint32_t delay_us)
{
    uint32_t core_clock_hz;
    uint64_t ticks_remaining;

    if (delay_us == 0U)
    {
        return;
    }

    core_clock_hz = CLOCK_GetFreq(kCLOCK_CoreSysClk);

    ticks_remaining =
        ((uint64_t)core_clock_hz * (uint64_t)delay_us) / 1000000ULL;

    while (ticks_remaining != 0ULL)
    {
        uint32_t chunk;

        if (ticks_remaining > 0x01000000ULL)
        {
            chunk = 0x01000000UL;
        }
        else
        {
            chunk = (uint32_t)ticks_remaining;
        }

        if (chunk == 0U)
        {
            chunk = 1U;
        }

        SysTick->CTRL = 0U;
        SysTick->LOAD = chunk - 1U;
        SysTick->VAL  = 0U;

        SysTick->CTRL =
            SysTick_CTRL_CLKSOURCE_Msk |
            SysTick_CTRL_ENABLE_Msk;

        while ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) == 0U)
        {
        }

        SysTick->CTRL = 0U;

        if (ticks_remaining >= (uint64_t)chunk)
        {
            ticks_remaining -= (uint64_t)chunk;
        }
        else
        {
            ticks_remaining = 0ULL;
        }
    }
}

