Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DigitalCompassDisplay/source/MKL25Z4_Project_SparkfunTFTHyperDisplayConfigure.c
/* -------------------------------------------------------------------------- */
/* I2C0 pin mux                                                               */
/* -------------------------------------------------------------------------- */

static void APP_InitI2CPins(void)
{
    CLOCK_EnableClock(kCLOCK_PortC);

    /*
     * KL25Z:
     *   PTC8 ALT2 = I2C0_SCL
     *   PTC9 ALT2 = I2C0_SDA
     */
    PORT_SetPinMux(
        COMPASS_SCL_PORT,
        COMPASS_SCL_PIN,
        kPORT_MuxAlt2);

    PORT_SetPinMux(
        COMPASS_SDA_PORT,
        COMPASS_SDA_PIN,
        kPORT_MuxAlt2);
}

/* -------------------------------------------------------------------------- */
/* Initialize I2C0                                                            */
/* -------------------------------------------------------------------------- */

static void APP_InitI2C0(void)
{
    i2c_master_config_t masterConfig;

    I2C_MasterGetDefaultConfig(&masterConfig);

    masterConfig.baudRate_Bps = COMPASS_I2C_BAUDRATE;

    I2C_MasterInit(
        COMPASS_I2C_BASE,
        &masterConfig,
        CLOCK_GetFreq(kCLOCK_BusClk));
}

/* -------------------------------------------------------------------------- */
/* TFT pin mux                                                                */
/* -------------------------------------------------------------------------- */

static void TFT_InitPins(void)
{
    CLOCK_EnableClock(kCLOCK_PortD);
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PTD1 = SPI0_SCK. */
    PORT_SetPinMux(
        TFT_SCK_PORT,
        TFT_SCK_PIN,
        kPORT_MuxAlt2);

    /* PTD2 = SPI0_SOUT / MOSI. */
    PORT_SetPinMux(
        TFT_MOSI_PORT,
        TFT_MOSI_PIN,
        kPORT_MuxAlt2);

    /* PTA17 = TFT CS GPIO. */
    PORT_SetPinMux(
        TFT_CS_PORT,
        TFT_CS_PIN,
        kPORT_MuxAsGpio);

    /* PTA16 = TFT D/C GPIO. */
    PORT_SetPinMux(
        TFT_DC_PORT,
        TFT_DC_PIN,
        kPORT_MuxAsGpio);
}

/* -------------------------------------------------------------------------- */
/* SPI0 initialization                                                        */
/* -------------------------------------------------------------------------- */

static void TFT_InitSPI(void)
{
    spi_master_config_t masterConfig;
    uint32_t sourceClockHz;

    CLOCK_EnableClock(kCLOCK_Spi0);

    SPI_MasterGetDefaultConfig(&masterConfig);

    masterConfig.baudRate_Bps =
        TFT_SPI_BAUDRATE_HZ;

    /* SPI Mode 0. */
    masterConfig.polarity =
        kSPI_ClockPolarityActiveHigh;

    masterConfig.phase =
        kSPI_ClockPhaseFirstEdge;

    masterConfig.direction =
        kSPI_MsbFirst;

    /*
     * TFT CS is manually controlled by the converted ILI9163C driver.
     */
    masterConfig.outputMode =
        kSPI_SlaveSelectAsGpio;

    masterConfig.pinMode =
        kSPI_PinModeNormal;

    sourceClockHz =
        CLOCK_GetFreq(kCLOCK_BusClk);

    SPI_MasterInit(
        TFT_SPI_BASE,
        &masterConfig,
        sourceClockHz);
}

/* -------------------------------------------------------------------------- */
/* HyperDisplay helpers                                                       */
/* -------------------------------------------------------------------------- */

static hyperdisplay_t *TFT_GetHyperDisplay(void)
{
    return &g_tft.ili9163c4wspi.ili9163c.hyperdisplay;
}

static void TFT_SetTextColor(ILI9163C_color_18_t *color)
{
    hyperdisplay_t *hd = TFT_GetHyperDisplay();

    hyperdisplay_setCurrentWindowColorSequence(
        hd,
        (color_t)color,
        1U,
        0U);
}

static void TFT_PrintString(
    int32_t x,
    int32_t y,
    const char *text)
{
    hyperdisplay_t *hd = TFT_GetHyperDisplay();

    if (text == NULL)
    {
        return;
    }

    hyperdisplay_setTextCursor(
        hd,
        x,
        y,
        NULL);

    while (*text != '\0')
    {
        (void)hyperdisplay_write(
            hd,
            (uint8_t)*text);

        text++;
    }
}

/* -------------------------------------------------------------------------- */
/* Integer-only terminal helpers                                              */
/* -------------------------------------------------------------------------- */

static char APP_GetFloatSign(float value)
{
    if (value < 0.0f)
    {
        return '-';
    }

    return '+';
}

static int32_t APP_FloatMagnitudeToMilliUnits(float value)
{
    float magnitude;

    magnitude = value;

    if (magnitude < 0.0f)
    {
        magnitude = -magnitude;
    }

    return (int32_t)(magnitude * 1000.0f + 0.5f);
}

static int32_t APP_NormalizedToThousandths(float value)
{
    float magnitude;

    magnitude = value;

    if (magnitude < 0.0f)
    {
        magnitude = -magnitude;
    }

    return (int32_t)(magnitude * 1000.0f + 0.5f);
}

static int APP_HeadingToTenths(float heading_deg)
{
    int heading_tenths;

    heading_tenths =
        (int)(heading_deg * 10.0f + 0.5f);

    if (heading_tenths >= 3600)
    {
        heading_tenths -= 3600;
    }

    if (heading_tenths < 0)
    {
        heading_tenths += 3600;
    }

    return heading_tenths;
}

/* -------------------------------------------------------------------------- */
/* Compass display: static green face                                         */
/* -------------------------------------------------------------------------- */

static void Compass_DrawFace(void)
{
    hyperdisplay_t *hd = TFT_GetHyperDisplay();
    uint32_t i;

    /*
     * Black background.
     */
    KWH018ST01_4WSPI_clearDisplay(&g_tft);

    /*
     * Outer green circle.
     */
    hyperdisplay_circle(
        hd,
        COMPASS_CENTER_X,
        COMPASS_CENTER_Y,
        COMPASS_RADIUS,
        false,
        (color_t)&g_colorGreen,
        1U,
        0U,
        false);

    /*
     * Tick marks.
     */
    for (i = 0U; i < COMPASS_NUM_TICKS; i++)
    {
        (void)hyperdisplay_line(
            hd,
            g_compassTicks[i].x1,
            g_compassTicks[i].y1,
            g_compassTicks[i].x2,
            g_compassTicks[i].y2,
            1U,
            (color_t)&g_colorGreen,
            1U,
            0U,
            false);
    }

