Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DigitalCompassDisplay/source/MKL25Z4_Project_SparkfunTFTHyperDisplayConfigure.c
    /*
     * 5x7 cardinal letters.
     */
    TFT_SetTextColor(&g_colorGreen);

    TFT_PrintString(61, 22, "N");
    TFT_PrintString(98, 55, "E");
    TFT_PrintString(61, 87, "S");
    TFT_PrintString(25, 55, "W");
}

/* -------------------------------------------------------------------------- */
/* Compass display: clear only the lower heading area                         */
/* -------------------------------------------------------------------------- */

static void Compass_ClearHeadingArea(void)
{
    hyperdisplay_t *hd = TFT_GetHyperDisplay();

    hyperdisplay_rectangle(
        hd,
        37.0,
        112.0,
        91.0,
        151.0,
        true,
        (color_t)&g_colorBlack,
        1U,
        0U,
        false,
        false);
}

/* -------------------------------------------------------------------------- */
/* Convert heading tenths into fixed 5x7 text: "143.8"                        */
/* -------------------------------------------------------------------------- */

static void Compass_FormatHeading(
    int heading_tenths,
    char text[6])
{
    int degrees;
    int tenths;

    if (heading_tenths < 0)
    {
        heading_tenths = 0;
    }

    if (heading_tenths >= 3600)
    {
        heading_tenths %= 3600;
    }

    degrees = heading_tenths / 10;
    tenths  = heading_tenths % 10;

    text[0] = (char)('0' + ((degrees / 100) % 10));
    text[1] = (char)('0' + ((degrees / 10) % 10));
    text[2] = (char)('0' + (degrees % 10));
    text[3] = '.';
    text[4] = (char)('0' + tenths);
    text[5] = '\0';
}

/* -------------------------------------------------------------------------- */
/* Determine N / NE / E / SE / S / SW / W / NW                              */
/* -------------------------------------------------------------------------- */

static const char *Compass_GetDirection(
    int heading_tenths)
{
    if ((heading_tenths >= 3375) ||
        (heading_tenths < 225))
    {
        return "N";
    }

    if (heading_tenths < 675)
    {
        return "NE";
    }

    if (heading_tenths < 1125)
    {
        return "E";
    }

    if (heading_tenths < 1575)
    {
        return "SE";
    }

    if (heading_tenths < 2025)
    {
        return "S";
    }

    if (heading_tenths < 2475)
    {
        return "SW";
    }

    if (heading_tenths < 2925)
    {
        return "W";
    }

    return "NW";
}

/* -------------------------------------------------------------------------- */
/* Needle vector from calibrated X/Y                                          */
/*                                                                            */
/* Your heading equation is:                                                  */
/*                                                                            */
/*     heading = atan2(Ycorrected, Xcorrected)                                */
/*                                                                            */
/* Therefore:                                                                 */
/*     heading 0 degrees   -> +X -> screen UP                                 */
/*     heading 90 degrees  -> +Y -> screen RIGHT                              */
/*                                                                            */
/* We use the already-calibrated X/Y vector directly instead of calling       */
/* sin() and cos(). A small magnitude approximation keeps needle length       */
/* nearly constant while preserving the angle.                               */
/* -------------------------------------------------------------------------- */

static void Compass_CalculateNeedleVector(
    float x_corrected,
    float y_corrected,
    int16_t *dx,
    int16_t *dy)
{
    float ax;
    float ay;
    float max_axis;
    float min_axis;
    float magnitude_approx;
    float scale;
    float dx_float;
    float dy_float;

    if ((dx == NULL) || (dy == NULL))
    {
        return;
    }

    ax = x_corrected;
    ay = y_corrected;

    if (ax < 0.0f)
    {
        ax = -ax;
    }

    if (ay < 0.0f)
    {
        ay = -ay;
    }

    if (ax > ay)
    {
        max_axis = ax;
        min_axis = ay;
    }
    else
    {
        max_axis = ay;
        min_axis = ax;
    }

    /*
     * Approximation to sqrt(x^2 + y^2):
     * max + 0.375 * min
     *
     * This avoids adding sinf/cosf/sqrtf to the display update.
     */
    magnitude_approx =
        max_axis + (0.375f * min_axis);

    if (magnitude_approx < 0.001f)
    {
        *dx = 0;
        *dy = -COMPASS_NEEDLE_FRONT;
        return;
    }

    scale =
        (float)COMPASS_NEEDLE_FRONT /
        magnitude_approx;

    /*
     * Screen coordinates:
     *   +X screen = right
     *   +Y screen = down
     *
     * Compass:
     *   +X magnetic = North/up
     *   +Y magnetic = East/right
     */
    dx_float = y_corrected * scale;
    dy_float = -x_corrected * scale;

    if (dx_float >= 0.0f)
    {
        *dx = (int16_t)(dx_float + 0.5f);
    }
    else
    {
        *dx = (int16_t)(dx_float - 0.5f);
    }

    if (dy_float >= 0.0f)
    {
        *dy = (int16_t)(dy_float + 0.5f);
    }
    else
    {
        *dy = (int16_t)(dy_float - 0.5f);
    }
}

/* -------------------------------------------------------------------------- */
/* Draw one two-color compass needle                                          */
/* -------------------------------------------------------------------------- */

static void Compass_DrawNeedleVector(
    int16_t dx,
    int16_t dy,
    ILI9163C_color_18_t *frontColor,
    ILI9163C_color_18_t *rearColor,
    bool drawHub)
{
    hyperdisplay_t *hd = TFT_GetHyperDisplay();

    int16_t rearDx;
    int16_t rearDy;

    rearDx =
        (int16_t)(-((int32_t)dx * COMPASS_NEEDLE_REAR) /
                  COMPASS_NEEDLE_FRONT);

    rearDy =
        (int16_t)(-((int32_t)dy * COMPASS_NEEDLE_REAR) /
                  COMPASS_NEEDLE_FRONT);

    /*
     * Rear half.
     */
    (void)hyperdisplay_line(
        hd,
        COMPASS_CENTER_X,
        COMPASS_CENTER_Y,
        COMPASS_CENTER_X + rearDx,
        COMPASS_CENTER_Y + rearDy,
        COMPASS_NEEDLE_WIDTH,
        (color_t)rearColor,
        1U,
        0U,
        false);

