Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DigitalCompassDisplay/source/MKL25Z4_Project_SparkfunTFTHyperDisplayConfigure.c
    /*
     * Front / heading half.
     */
    (void)hyperdisplay_line(
        hd,
        COMPASS_CENTER_X,
        COMPASS_CENTER_Y,
        COMPASS_CENTER_X + dx,
        COMPASS_CENTER_Y + dy,
        COMPASS_NEEDLE_WIDTH,
        (color_t)frontColor,
        1U,
        0U,
        false);

    if (drawHub)
    {
        /*
         * White center hub.
         */
        hyperdisplay_circle(
            hd,
            COMPASS_CENTER_X,
            COMPASS_CENTER_Y,
            3,
            true,
            (color_t)&g_colorWhite,
            1U,
            0U,
            false);

        /*
         * Black center dot.
         */
        hyperdisplay_circle(
            hd,
            COMPASS_CENTER_X,
            COMPASS_CENTER_Y,
            1,
            true,
            (color_t)&g_colorBlack,
            1U,
            0U,
            false);
    }
}

/* -------------------------------------------------------------------------- */
/* Erase previous moving needle                                               */
/* -------------------------------------------------------------------------- */

static void Compass_ErasePreviousNeedle(void)
{
    if (!g_previousNeedleValid)
    {
        return;
    }

    Compass_DrawNeedleVector(
        g_previousNeedleDx,
        g_previousNeedleDy,
        &g_colorBlack,
        &g_colorBlack,
        false);
}

/* -------------------------------------------------------------------------- */
/* Update heading text                                                        */
/* -------------------------------------------------------------------------- */

static void Compass_DrawHeadingText(
    int heading_tenths)
{
    hyperdisplay_t *hd = TFT_GetHyperDisplay();
    char headingText[6];
    const char *direction;

    Compass_ClearHeadingArea();

    Compass_FormatHeading(
        heading_tenths,
        headingText);

    direction =
        Compass_GetDirection(
            heading_tenths);

    TFT_SetTextColor(&g_colorGreen);

    /*
     * Fixed-width heading "000.0" through "359.9".
     */
    TFT_PrintString(
        49,
        118,
        headingText);

    /*
     * Small drawn degree symbol.
     */
    hyperdisplay_circle(
        hd,
        82,
        119,
        2,
        false,
        (color_t)&g_colorGreen,
        1U,
        0U,
        false);

    /*
     * Cardinal/intercardinal direction.
     * Two characters fit comfortably with the existing 5x7 font.
     */
    if (direction[1] == '\0')
    {
        TFT_PrintString(
            61,
            134,
            direction);
    }
    else
    {
        TFT_PrintString(
            58,
            134,
            direction);
    }
}

/* -------------------------------------------------------------------------- */
/* Update live compass display                                                */
/* -------------------------------------------------------------------------- */

static void Compass_UpdateDisplay(
    float x_corrected,
    float y_corrected,
    int heading_tenths)
{
    int16_t dx;
    int16_t dy;

    Compass_CalculateNeedleVector(
        x_corrected,
        y_corrected,
        &dx,
        &dy);

    /*
     * Remove only the previous needle.
     * The needle is intentionally short enough that this does not touch
     * the green outer scale or N/E/S/W labels.
     */
    Compass_ErasePreviousNeedle();

    /*
     * Draw new red/white needle.
     */
    Compass_DrawNeedleVector(
        dx,
        dy,
        &g_colorRed,
        &g_colorWhite,
        true);

    g_previousNeedleDx = dx;
    g_previousNeedleDy = dy;
    g_previousNeedleValid = true;

    /*
     * Update only the lower numerical readout.
     */
    Compass_DrawHeadingText(
        heading_tenths);
}

/* -------------------------------------------------------------------------- */
/* Standalone status messages for battery-powered testing                     */
/* -------------------------------------------------------------------------- */

static void Compass_ShowStatus(
    const char *text,
    bool isError)
{
    Compass_ClearHeadingArea();

    if (isError)
    {
        TFT_SetTextColor(&g_colorRed);
    }
    else
    {
        TFT_SetTextColor(&g_colorGreen);
    }

    /*
     * Status text begins at x=43 so strings such as "CALIB" or "MAG ERR"
     * fit in the lower area using the 5x7 font.
     */
    TFT_PrintString(
        43,
        128,
        text);
}

/* -------------------------------------------------------------------------- */
/* main                                                                       */
/* -------------------------------------------------------------------------- */

int main(void)
{
    compass_t compass;
    compass_data_t data;

    ILI9163C_STAT_t tftStatus;

    float x_corrected;
    float y_corrected;
    float heading_deg;

    int heading_tenths;

    char x_sign;
    char y_sign;
    char z_sign;
    char xc_sign;
    char yc_sign;

    int32_t x_comp_mag_mg;
    int32_t y_comp_mag_mg;
    int32_t z_comp_mag_mg;

    int32_t x_corrected_thousandths;
    int32_t y_corrected_thousandths;

    int32_t x_bridge_offset_mg;
    int32_t y_bridge_offset_mg;
    int32_t z_bridge_offset_mg;

    /* ---------------------------------------------------------------------- */
    /* KL25Z board initialization                                             */
    /* ---------------------------------------------------------------------- */

    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitDebugConsole();

    /*
     * Explicitly configure both peripheral pin groups after BOARD_InitBootPins
     * so this merged project does not depend on the old project's pin_mux.c.
     */
    TFT_InitPins();
    APP_InitI2CPins();

    TFT_InitSPI();
    APP_InitI2C0();

    PRINTF("\r\n");
    PRINTF("====================================================\r\n");
    PRINTF(" FRDM-KL25Z MMC5983MA + TFT Compass\r\n");
    PRINTF("====================================================\r\n");
    PRINTF("TFT: PTD1=SCK PTD2=MOSI PTA17=CS PTA16=D/C\r\n");
    PRINTF("I2C0: PTC8=SCL, PTC9=SDA\r\n");
    PRINTF("MMC5983MA address: 0x30\r\n");
    PRINTF("\r\n");

    /* ---------------------------------------------------------------------- */
    /* Initialize TFT                                                        */
    /* ---------------------------------------------------------------------- */

    KWH018ST01_4WSPI_init(
        &g_tft);

    tftStatus =
        KWH018ST01_4WSPI_begin(
            &g_tft,

