Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DigitalCompassDisplay/source/MKL25Z4_Project_SparkfunTFTHyperDisplayConfigure.c
            TFT_SPI_BASE,

            TFT_DC_GPIO,
            TFT_DC_PIN,

            TFT_CS_GPIO,
            TFT_CS_PIN,

            NULL,
            NULL,

            TFT_SPI_BAUDRATE_HZ);

    if (tftStatus != ILI9163C_STAT_Nominal)
    {
        PRINTF("TFT initialization FAILED.\r\n");

        while (1)
        {
        }
    }

    /*
     * Create persistent colors.
     */
    g_colorGreen =
        ILI9163C_rgbTo18b(
            80U,
            255U,
            40U);

    g_colorRed =
        ILI9163C_rgbTo18b(
            255U,
            30U,
            20U);

    g_colorWhite =
        ILI9163C_rgbTo18b(
            255U,
            255U,
            255U);

    g_colorBlack =
        ILI9163C_rgbTo18b(
            0U,
            0U,
            0U);

    PRINTF("TFT initialization OK\r\n");

    /*
     * Draw the static green face once.
     */
    Compass_DrawFace();

    /*
     * When running from VIN with no laptop, this gives visible feedback that
     * the firmware has booted and is calibrating the magnetometer.
     */
    Compass_ShowStatus(
        "CALIB",
        false);

    /* ---------------------------------------------------------------------- */
    /* Initialize MMC5983MA                                                   */
    /* ---------------------------------------------------------------------- */

    COMPASS_Init(
        &compass,
        COMPASS_I2C_BASE);

    PRINTF("Starting MMC5983MA...\r\n");

    if (!COMPASS_Begin(&compass))
    {
        PRINTF("COMPASS_Begin FAILED\r\n");
        PRINTF(
            "Last I2C status = %d\r\n",
            (int)COMPASS_LastI2CStatus(&compass));

        Compass_ShowStatus(
            "MAG ERR",
            true);

        while (1)
        {
        }
    }

    PRINTF("COMPASS_Begin OK\r\n");
    PRINTF(
        "Product ID = 0x%02X\r\n",
        compass.product_id);

    if (compass.product_id !=
        COMPASS_PRODUCT_ID_EXPECTED)
    {
        PRINTF("Unexpected Product ID\r\n");

        Compass_ShowStatus(
            "ID ERR",
            true);

        while (1)
        {
        }
    }

    /* ---------------------------------------------------------------------- */
    /* Magnetic measurement bandwidth                                        */
    /* ---------------------------------------------------------------------- */

    if (!COMPASS_SetBandwidth(
            &compass,
            kCompassBandwidth100Hz))
    {
        PRINTF("Bandwidth configuration FAILED\r\n");

        Compass_ShowStatus(
            "BW ERR",
            true);

        while (1)
        {
        }
    }

    PRINTF("Bandwidth: 100 Hz setting\r\n");

    /* ---------------------------------------------------------------------- */
    /* SET/RESET bridge-offset calibration                                    */
    /* ---------------------------------------------------------------------- */

    PRINTF("\r\n");
    PRINTF("Running SET/RESET bridge-offset calibration...\r\n");
    PRINTF("Keep the sensor stationary during this step.\r\n");

    if (!COMPASS_CalibrateBridgeOffset(&compass))
    {
        PRINTF("Bridge-offset calibration FAILED\r\n");
        PRINTF(
            "Last I2C status = %d\r\n",
            (int)COMPASS_LastI2CStatus(&compass));

        Compass_ShowStatus(
            "CAL ERR",
            true);

        while (1)
        {
        }
    }

    x_bridge_offset_mg =
        (int32_t)(
            compass.bridge_offset_gauss[0] *
            1000.0f);

    y_bridge_offset_mg =
        (int32_t)(
            compass.bridge_offset_gauss[1] *
            1000.0f);

    z_bridge_offset_mg =
        (int32_t)(
            compass.bridge_offset_gauss[2] *
            1000.0f);

    PRINTF("Bridge-offset calibration OK\r\n");
    PRINTF("Bridge offsets:\r\n");
    PRINTF(
        "  X = %d mG\r\n",
        (int)x_bridge_offset_mg);
    PRINTF(
        "  Y = %d mG\r\n",
        (int)y_bridge_offset_mg);
    PRINTF(
        "  Z = %d mG\r\n",
        (int)z_bridge_offset_mg);

    PRINTF("\r\n");
    PRINTF("Four-point 2D calibration loaded:\r\n");
    PRINTF("  X bias   = -25.5 mG\r\n");
    PRINTF("  Y bias   = +137.5 mG\r\n");
    PRINTF("  X radius = 236.5 mG\r\n");
    PRINTF("  Y radius = 247.5 mG\r\n");
    PRINTF("\r\n");
    PRINTF("Starting calibrated heading measurements...\r\n");
    PRINTF("\r\n");

    /*
     * Remove CALIB status before first live update.
     */
    Compass_ClearHeadingArea();

    /* ---------------------------------------------------------------------- */
    /* Main measurement / display loop                                        */
    /* ---------------------------------------------------------------------- */

    while (1)
    {
        if (!COMPASS_Measure(
                &compass,
                &data))
        {
            PRINTF(
                "Measurement FAILED. I2C status=%d\r\n",
                (int)COMPASS_LastI2CStatus(&compass));

            Compass_ShowStatus(
                "I2C ERR",
                true);

            APP_DelayUs(
                100000U);

            continue;
        }

        /*
         * FOUR-POINT 2D CALIBRATION
         *
         * compass.c has already removed the internal SET/RESET bridge offset.
         * Now remove environmental X/Y bias and normalize the two radii.
         */
        x_corrected =
            (data.x_gauss - COMPASS_X_BIAS_G) /
            COMPASS_X_RADIUS_G;

        y_corrected =
            (data.y_gauss - COMPASS_Y_BIAS_G) /
            COMPASS_Y_RADIUS_G;

        /*
         * Same known-good heading equation from the compass-only project.
         */
        heading_deg =
            atan2f(
                y_corrected,
                x_corrected) *
            RAD_TO_DEG;

        if (heading_deg < 0.0f)
        {
            heading_deg += 360.0f;
        }

        if (heading_deg >= 360.0f)
        {
            heading_deg -= 360.0f;
        }

        heading_tenths =
            APP_HeadingToTenths(
                heading_deg);

