Emanuel2023/EmanuelsProjects/MKL25Z4_Project_DigitalCompassDisplay/source/MKL25Z4_Project_SparkfunTFTHyperDisplayConfigure.c
        /*
         * Update the TFT from the exact same calibrated X/Y vector used by
         * the heading equation.
         */
        Compass_UpdateDisplay(
            x_corrected,
            y_corrected,
            heading_tenths);

        /* ------------------------------------------------------------------ */
        /* Preserve the useful compass terminal diagnostics                   */
        /* ------------------------------------------------------------------ */

        x_sign =
            APP_GetFloatSign(
                data.x_gauss);

        y_sign =
            APP_GetFloatSign(
                data.y_gauss);

        z_sign =
            APP_GetFloatSign(
                data.z_gauss);

        x_comp_mag_mg =
            APP_FloatMagnitudeToMilliUnits(
                data.x_gauss);

        y_comp_mag_mg =
            APP_FloatMagnitudeToMilliUnits(
                data.y_gauss);

        z_comp_mag_mg =
            APP_FloatMagnitudeToMilliUnits(
                data.z_gauss);

        xc_sign =
            APP_GetFloatSign(
                x_corrected);

        yc_sign =
            APP_GetFloatSign(
                y_corrected);

        x_corrected_thousandths =
            APP_NormalizedToThousandths(
                x_corrected);

        y_corrected_thousandths =
            APP_NormalizedToThousandths(
                y_corrected);

        PRINTF(
            "Comp X=%c%d mG Y=%c%d mG Z=%c%d mG | "
            "Cal X=%c%d Y=%c%d | "
            "Heading=%d.%d deg\r\n",

            x_sign,
            (int)x_comp_mag_mg,

            y_sign,
            (int)y_comp_mag_mg,

            z_sign,
            (int)z_comp_mag_mg,

            xc_sign,
            (int)x_corrected_thousandths,

            yc_sign,
            (int)y_corrected_thousandths,

            heading_tenths / 10,
            heading_tenths % 10);

        /*
         * 10 Hz display / measurement update.
         */
        APP_DelayUs(
            100000U);
    }
}
